# Merge com pandas

In [1]:
import pandas as pd
from numpy.random import randn

In [2]:
df1 = pd.DataFrame({
    'FLAMENGO': [1,2,3,4],
    'SÃO PAULO': [4,3,2,1],
    'GRÊMIO': [1,2,3,4],
    'FORTALEZA': [4,3,2,1],
    'CEARÁ': [1,2,3,4],
    'CRUZEIRO': [4,3,2,1],
    'FLUMINENCE': [1,2,3,4],
    },
    index=['Placar 1','Placar 2','Placar 3','Placar 4']
)
df1

          FLAMENGO  SÃO PAULO  GRÊMIO  FORTALEZA  CEARÁ  CRUZEIRO  FLUMINENCE
Placar 1         1          4       1          4      1         4           1
Placar 2         2          3       2          3      2         3           2
Placar 3         3          2       3          2      3         2           3
Placar 4         4          1       4          1      4         1           4

In [6]:
df = pd.DataFrame(randn(3,3),index='1 2 3'.split(), columns='3 2 1'.split())
df

          3         2         1
1 -0.298737  1.061884 -0.343667
2  0.334671 -0.909897 -0.594869
3 -1.285778 -0.079157 -0.370571